{
    "sections": [
        {
            "id": "about",
            "component": "AboutSection",
            "class": "agency-section",
            "navbar": {
                "label": "เหตุผลที่อยากเข้า",
                "faIcon": "fa-solid fa-file"
            },
            "headline": {
                "title": "<span class='text-primary'>เหตุผลที่อยากเข้า</span>",
                "subtitle": "คณะเทคโนโลยีสารสนเทศ สาขาเทคโนโลยีสารสนเทศ",
                "subtitle1": "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี"
            },
            "items": [
                {
                    "imageUrl": "images/logo/nan.png",
                    "description": [
                        "ผมมีความสนใจในสาขาวิชาเทคโนโลยีสารสนเทศอย่างมาก ตั้งแต่ได้เรียนในระดับ ปวช. สาขาเทคโนโลยีสารสนเทศ และพบว่าผมมีความชื่นชอบในการเขียนโปรแกรมและต้องการต่อยอดความรู้เพื่อประกอบอาชีพในอนาคต",
                        "ผมเคยมีประสบการณ์ในการพัฒนาเว็บไซต์เกี่ยวกับการท่องเที่ยวในอำเภอบ้านเกิดโดยใช้ Vue.js โดยมีเป้าหมายให้เว็บไซต์ติดอันดับหนึ่งในการค้นหาด้วย SEO ผ่านการใช้คีย์เวิร์ด 'คาเฟ่ในอำเภอปัว' ซึ่งประสบความสำเร็จ ทำให้เกิดแรงบันดาลใจในการเรียนต่อในสาขานี้",
                        "นอกจากนี้ผมได้ฝึกงานที่บริษัทเขียนโปรแกรมและพัฒนาแอพพลิเคชันแห่งหนึ่งในจังหวัดน่านซึ่งทำให้ผมมีโอกาสเรียนรู้เกี่ยวกับ Vue.js และ Java Spring Boot ได้ฝึกทักษะการทำงานเป็นทีมและเข้าใจการทำงานของแต่ละแผนก ซึ่งเป็นประสบการณ์ที่มีคุณค่าและเป็นพื้นฐานสำคัญในการศึกษาต่อ",
                        "ผมมีทักษะด้านโปรแกรมมิ่งที่สอดคล้องกับสาขาวิชานี้ ได้แก่ HTML,CSS,JavaScript,Node.js,Vue.js,Python,PHP,PostgreSQL และการใช้ Bootstrap,Git,MySQL และการสร้าง REST API ใน Java Spring Boot รวมถึงการใช้ Vue.js ร่วมกับ Axios ในการดึง API มาใช้งาน อีกทั้งยังมีทักษะการใช้ซอฟต์แวร์ที่เกี่ยวข้อง ได้แก่ Postman,DBeaver,XAMPP,Figma",
                        "ด้วยความรู้และประสบการณ์เหล่านี้ผมเชื่อว่าการศึกษาต่อในคณะเทคโนโลยีสารสนเทศ สาขาเทคโนโลยีสารสนเทศ ที่มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรีจะช่วยให้ผมสามารถพัฒนาทักษะและความสามารถของตนเองให้ก้าวหน้าไปได้อย่างมีประสิทธิภาพ และเป็นก้าวสำคัญในการประกอบอาชีพในอนาคต"
                    ]
                }
            ],
            "footer": {
                "title": "คณะเทคโนโลยีสารสนเทศ <span class='text-primary'>สาขาวิชาเทคโนโลสีสารสนเทศ</span>",
                "smallDescription": false
            }
        },
        {
            "id": "services",
            "component": "ServicesSection",
            "class": "agency-section-primary",
            "navbar": {
                "label": "ความสามารถด้านโปรแกรมมิ่ง",
                "faIcon": "fa-solid fa-wrench"
            },
            "headline": {
                "title": "Programming <span class='text-primary'>Skill</span>",
                "subtitle": "ความสามารถด้านโปรแกรมมิ่งของผม"
            },
            "items": [
                {
                    "title": "Java Script",
                    "faIcon": "devicon-javascript-plain colored",
                    "description": "ผมได้ศึกษา Java Scrip ด้วยตนเอง และได้นำมาต่อยอดในการใช้งานจริงที่ฝึกงานบริษัทเขียนโปรแกรมแห่งหนึ่งในจัวหวัดน่าน โดยทั้งการใช้ FRAMEWORK และร่วมกับการเรียกใช้ API"
                },
                {
                    "title": "HTML",
                    "faIcon": "devicon-html5-plain-wordmark colored",
                    "description": "เป็นพื้นฐานที่เริ่มเรียนจากที่โรงเรียนและฝึกเพิ่มเติมด้วยการศึกษาด้วยตนเอง นำมาฝึกทำโปรเจคเล่นๆ Single Page ร่วมกับ CSS จนเชี่ยวชาญ"
                },
                {
                    "title": "CSS",
                    "faIcon": "devicon-css3-plain-wordmark colored",
                    "description": "ศึกษาด้วยตนเอง รวมไปถึงการใช้ Grid Flex ต่างๆ นำมาฝึกทำโปรเจคเล่นๆ Single Page ร่วมกับ HTML จนเชี่ยวชาญ และนำความรู้เหล่านี้ไปต่อยอดทำเว็บไซต์ของตัวเองโดย Hard Code ในการแก้ไขข้อมูลหน้าต่างๆ"
                },
                {
                    "title": "PHP",
                    "faIcon": "devicon-php-plain colored",
                    "description": "ศึกษาด้วยตนเอง โดยต้องศึกษาเพื่อนำไปแข่งขันการเขียนโปรแกรมในระดับชั้นปวช. โดยสามารถเขียน Pure PHP ได้ แต่ไม่ถึงขั้นเขียน OOP ได้รวมถึง FRAMEWORK ที่เกียวกับ PHP ตอนไปแข่งขัน เขาห้ามใช้  Extension ใน Vs Code และ ห้ามใช้ FRAMEWORK ยกเว้น Bootstrap"
                },
                {
                    "title": "JAVA",
                    "faIcon": "devicon-java-plain-wordmark colored",
                    "description": "ศึกษาด้วยตนเอง เพื่อเตรียมความพร้อมสำหรับการฝึกงาน Backend ที่จะไปฝึกงานใช้ Spring Boot ในการทำ REST API จึงเรียนพื้นฐานภาษา Java มาเพื่อเตรียมความพร้อม"
                },
                {
                    "title": "Bootstrap",
                    "faIcon": "devicon-bootstrap-plain-wordmark colored",
                    "description": "เป็น FRAMEWORK แรกที่ได้ศึกษาด้วยตนเอง นำมาใช้ร่วมกับ PHP ในการแข่งขัน โดยนำมาช่วยตกแต่ง UI ได้ง่าย โดยไม่จำเป็นต้องเขียน CSS ด้วยตนเองเยอะ"
                },
                {
                    "title": "Vue Js",
                    "faIcon": "devicon-vuejs-plain-wordmark colored",
                    "description": "เป็น FRAMEWORK ที่ได้ศึกษาด้วยตนเอง และได้ลองนำมาทำโปรเจคเว็บไซต์ Single Page ของตัวเอง เป็นเว็บไซต์เกี่ยวกับการส่งเสริมการท่องเที่ยว คาเฟ่ในอำเภอปัว"
                },
                {
                    "title": "Vuetify",
                    "faIcon": "devicon-vuetify-plain colored",
                    "description": "เป็น UI FRAMEWORK ที่ได้ศึกษาด้วยตนเองและได้รับคำแนะนำจากพี่ที่ฝึกงาน ในการมาทำหน้าตา UI ต่างๆและเรียกใช้ API เส้นต่างๆจาก Spring boot โดยได้นำความรู้มาช่วยทำโปรเจคให้บริษัทที่ฝึกงาน"
                },
                {
                    "title": "React",
                    "faIcon": "devicon-react-original-wordmark colored",
                    "description": "เป็น FRAMEWORK ที่ได้ศึกษาด้วยตนเองเนื่องจากสงสัยว่าประสิทธิภาพและการทำ SEO ดีกว่า Vue Js หรือไม่ เลยทำโปรเจคเว็บไซต์ Single Page เกี่ยวกับวัดในอำเภอปัวมาเปรียบเทียบ"
                },
                {
                    "title": "Spring Boot",
                    "faIcon": "devicon-spring-original-wordmark colored",
                    "description": "เป็น FRAMEWORK ที่ได้ความรู้จากที่ฝึกงาน โดยได้มีความรู้พื้นฐานของ Java มาแล้วจึงเรียนรู้การสร้าง Class และทำ API เส้นต่างๆได้ง่าย โดยมีความรู้ทั้งการทำ Entity Controller Service Repository และการสร้าง Model การทำรายงาน export ออกมาเป็น pdf และอื่นๆ"
                },
                {
                    "title": "MYSQL",
                    "faIcon": "devicon-mysql-plain-wordmark colored",
                    "description": "เป็นภาษาโปรแกรมมิ่งที่ได้เรียนรู้จากโรงเรียนและศึกษาเพิ่มเติมด้วยตนเอง และได้นำมาใช้ร่วมกับ PHP ในการแข่งขันการเขียนโปรแกรมคอมพิวเตอร์ และได้นำมาใช้ร่วมกับ Repository ใน Spring boot เพื่อใช้คำสั่ง SQL ประกอบการทำเส้น API ต่างๆ"
                },
                {
                    "title": "GIT",
                    "faIcon": "devicon-git-plain-wordmark colored",
                    "description": "เป็น VCS มาใช้ในการ push ขึ้น Github เพื่ออัพเดตโปรเจคต่างๆของเว็บไซต์ ก่อนหน้านี้เขียนเป็นคำสั่ง git ในการ pull add commit push ต่างๆ แต่ได้ Extention Git Graph มาจากพี่ที่ฝึกงาน ทำให้ Commit Fetch อะไรกับทีมได้ง่าย"
                },
                {
                    "title": "PostgreSQL",
                    "faIcon": "devicon-postgresql-plain-wordmark colored",
                    "description": "ได้ศึกษาด้วยตนเอง มารันใน Localhost เพื่อทำโปรเจคและทดสอบโปรเจค ก่อนไปรันบน Production"
                },
                {
                    "title": "VS Code",
                    "faIcon": "devicon-vscode-plain colored",
                    "description": "ได้ศึกษาด้วยตนเอง ใช้เป็นเครื่องมือในการเขียนโปรแกรม HTML CSS JavaScript PHP และอื่นๆ"
                },
                {
                    "title": "Eclipse IDE for Java",
                    "faIcon": "devicon-eclipse-plain-wordmark colored",
                    "description": "ได้ความรู้จากที่ฝึกงาน ในการใช้เป็นเครื่องมือในการทำและรันโปรเจค Backend ภาษา Java FRAMEWORK Spring boot"
                },
                {
                    "title": "Postman",
                    "faIcon": "devicon-postman-plain colored",
                    "description": "ได้ความรู้จากที่ฝึกงาน ใช้ทดสอบ API เส้นต่างๆ SELECT POST PUT DELETE"
                },
                {
                    "title": "DBeaver",
                    "faIcon": "devicon-dbeaver-plain colored",
                    "description": "ได้ความรู้จากที่ฝึกงาน ใช้จัดการ Data ต่างๆในฐานข้อมูล และการเขียน Script Select หาข้อมูล และ สร้าง View เพื่อนำไปประกอบการสร้างรายงาน"
                },
                {
                    "title": "Figma",
                    "faIcon": "devicon-figma-plain colored",
                    "description": "ได้เรียนรู้จากพี่ที่ฝึกงาน ในการออกแบบเว็บไซต์โมดูลต่างๆก่อนลงมือ Coding"
                }
            ],
            "footer": {}
        },
        {
            "id": "history",
            "component": "HistorySection",
            "class": "agency-section",
            "navbar": {
                "label": "การศึกษา",
                "faIcon": "fa-solid fa-clock"
            },
            "headline": {
                "title": "<span class='text-primary'>Education</span>",
                "subtitle": "ประวัติการศึกษาตั้งแต่ ปี 2562-2567"
            },
            "items": [
                {
                    "title": "โรงเรียนปัว",
                    "date": "2019 → 2021",
                    "description": "ระดับชั้นมัธยมศึกษาตอนต้น GPAX 5 ภาคเรียน 3.33",
                    "imageUrl": "images/history/Pua.png"
                },
                {
                    "title": "วิทยาลัยเทคนิคปัว",
                    "date": "2022 → 2025",
                    "description": "ระดับชั้นมัธยมศึกษาตอนปลาย GPAX 5 ภาคเรียน 3.81",
                    "imageUrl": "images/history/PuaTc.png"
                },
                {
                    "title": "บริษัท 98 อัลฟ่าเอ็มบอดิเม็นต์ จำกัด",
                    "date": "2024 → ...",
                    "description": "ทำงานในตำแหน่ง Frontend Developer",
                    "imageUrl": "images/history/98alpha.png"
                }
            ],
            "footer": {}
        },
        {
            "id": "portfolio",
            "component": "PortfolioSection",
            "class": "agency-section-primary",
            "navbar": {
                "label": "Portfolio",
                "faIcon": "fa-solid fa-camera"
            },
            "headline": {
                "title": "<span class='text-primary'>Portfolio</span> <br/> นายณัฐวัตร จิตอารี",
                "subtitle": "รวมโปรเจคต่างๆ"
            },
            "items": [
                {
                    "title": "คาเฟ่ อำเภอปัว",
                    "category": "Website Single Page",
                    "description": "<b>คาเฟ่ อำเภอปัว</b> คือโปรเจค Website Single Page ทำ SEO ให้ติดอันดับ 1 ในหน้าแรกของการค้นหาของ Google เพื่อส่งเสริมการท่องเที่ยวให้กับอำเภอปัว จังหวัดน่าน โดยใช้ HTML CSS JavaScript และ Vue Js Framework การหาข้อมูล และถ่ายรูปภาพด้วยตนเอง",
                    "imageUrl": "images/portfolio/cafepua.png",
                    "tags": [
                        "Single Page Website"
                    ],
                    "links": [
                        {
                            "faIcon": "fa-brands fa-chrome",
                            "href": "https://nan.puanj.com/pua/cafe"
                        }
                    ]
                },
                {
                    "title": "59 วัด อำเภอปัว จังหวัดน่าน",
                    "category": "Website Single Page",
                    "description": "<b>59 วัด อำเภอปัว จังหวัดน่าน</b> คือโปรเจค Website Single Page ทำ SEO ให้ติดอันดับ ในหน้าแรกของการค้นหาของ Google เพื่อส่งเสริมการท่องเที่ยวและวัฒนธรรมให้กับอำเภอปัว จังหวัดน่าน โดยใช้ HTML CSS JavaScript และ React Framework ถ่ายรูปภาพด้วยตนเอง ข้อมูลบางส่วนนำมาจากเว็บไซต์อ้างอิงและบางส่วนขอข้อมูลจากทางวัด",
                    "imageUrl": "images/portfolio/templepua.png",
                    "tags": [
                        "Single Page Website"
                    ],
                    "links": [
                        {
                            "faIcon": "fa-brands fa-chrome",
                            "href": "https://temple.puanj.com/temple"
                        }
                    ]
                }
            ],
            "footer": {}
        }
    ]
}